"use strict"

//==================================MAP=========================================================================

// Как и обычный объект это коллекция пар КЛЮЧ - ЗНАЧЕНИЕ. 
// Основное отличие в том, что КЛЮЧОМ МОЖЕТ БЫТЬ НЕ ТОЛЬКО СТРОКА.
// К примеру число, булево значения, или даже другой объект.

//==================================SET=========================================================================

// Это особая коллекция, без ключей, только значения.
// Особенность в том, что set ХРАНИТ ТОЛЬКО УНИКАЛЬНЫЕ ЗНАЧЕНИЯ.
// При попытке записать в него уже существующее значени, оно не запишется.


//==================================WeakMAP=========================================================================

// Особый вид Map-a
// Его ключами могут быть ТОЛЬКО объекты.
// ВАЖНО! Его пара ключ-свойство, существует только до тех пор, пока объект, который послужил ключом существует где-нибудь еще (в переменной, как элемент другого объекта/массива и т.д)
// Это позволяет использовать WeakMap как кэш или самоочищаюшееся хранилище, т.к. когда пропадет объект, являющийся ключом в WeakMAP, пропадут и все пары ключ-свойство с этим объектом.

//==================================WeakSET=========================================================================

// Особый вид Set-a
// В его коллекции могут быть ТОЛЬКО объекты.
// ВАЖНО! Его элемент коллекции, существует только до тех пор, пока объект, который мы "положили" в WeakSet существует где-нибудь еще (в переменной, как элемент другого объекта/массива и т.д)
// В отличии от WeakMap, мы не можем описать объект лежащий в WeakSet-е, его область применения ограничена в основном тем что мы можем узнать, есть ли что-то в WeakSet-е или нет.


//==============================================================================================================
function unique(arr) {
	return Array.from(new Set(arr));
}

let values = ["Hare", "Krishna", "Hare", "Krishna",
	"Krishna", "Krishna", "Hare", "Hare", ":-O"
];

console.log( unique(values) ); // Hare,Krishna,:-O

let uni = unique(values);
console.log( uni );


//==============================================================================================================

let arr = ["nap", "teachers", "cheaters", "PAN", "ear", "era", "hectares"];

function aclean(arr) {
	let set = new Set();
	let result = [];
	for (let item of arr) {
		let prop = item.toUpperCase().split('').sort().join('');
		if ( !set.has(prop) ) {
			set.add(prop);
			result.push(item);
		}
	}
	return result;
}

function aclean2(arr) {
	let map = new Map();
	for (let item of arr) {
		map.set((item.toLowerCase().split('').sort().join('')), item);
	}
	return Array.from(map.values());
};

console.log( 'Через MAP', aclean2(arr) );
console.log( 'Через SET', aclean(arr) ); // "nap,teachers,ear" или "PAN,cheaters,era"


//==============================================================================================================
let map = new Map();

map.set("name", "John");

let keys = Array.from(map.keys());
console.log(keys);

keys.push("more");
console.log(keys);



//==============================================================================================================

